import { Question } from "./TestPage";

export const testData: Question[] = [
    {
      _id: "1",
      questions: "Как часто вы забываете, куда положили повседневные вещи, такие как ключи или очки?",
      options: ["Редко", "Иногда", "Часто", "Почти всегда"],
    },
    {
      _id: "2",
      questions: "Насколько точно вы помните недавние события или разговоры?",
      options: [
        "Очень точно",
        "В основном точно",
        "Иногда точно",
        "Редко точно",
      ],
    },
    {
      _id: "3",
      questions: "Как часто вы забываете важные даты, такие как дни рождения или годовщины?",
      options: ["Редко", "Иногда", "Часто", "Почти всегда"],
    },
    {
      _id: "4",
      questions: "Когда нужно выбрать между двумя похожими предметами, как часто вам трудно вспомнить, какой вы предпочитаете?",
      options: ["Редко", "Иногда", "Часто", "Почти всегда"],
    },
    {
      _id: "5",
      questions: "Часто ли вы полагаетесь на напоминания или записи, чтобы помнить важные задачи или информацию?",
      options: ["Никогда", "Редко", "Иногда", "Всегда"],
    },
    {
      _id: "6",
      questions: "Как часто вам трудно вспомнить недавние разговоры или события, когда вас спрашивают об этом позже?",
      options: ["Редко", "Иногда", "Часто", "Почти всегда"],
    },
    {
      _id: "7",
      questions: `Запомните следующие цифры: [8152639],
        Пожалуйста, введите показанные цифры`,
      options: ["8152639, 8152631, 8152633, 8152636"],
    },
    {
      _id: "8",
      questions: `Запомните следующие цифры: [539847261],
        Пожалуйста, введите показанные цифры`,
      options: ["539347261, 539847267, 539847269, 539847263"],
    },
  ];
  